Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: །དེ་དག་ཐམས་ཅད་ངའི་ཐད་དུ་འོངས་པ་དང་ངས་ཆོས་བསྟན་པས་རང་སངས་རྒྱས་ཀྱི་ལམ་ཐོབ་པར་གྱུར་ནས་མངོན་པར་ཤེས་པ་དྲུག་དང་ལྡན་ཞིང་སེམས་ལ་རང་དབང་ཐོབ་པ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་ལྡན་པར་གྱུར་པས་རྟག་པར་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ནས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དག་ཏུ་ཞུགས་ཏེ་བསོད་སྙོམས་བསླངས་ནས་ང་ལ་རིམ་གྲོ་བྱས་སོ།
en: They all came to see me, and I taught them the Dharma. They eventually reached the path of the solitary buddhas, developed the six higher perceptions, and obtained mental freedom. Endowed with the bases of miraculous powers, they would always miraculously rise up into the sky, and in this way enter villages, cities, and towns. After receiving their alms, they would then venerate me with them.

source: །ང་དེའི་ཚེ་འདི་སྙམ་དུ་འདི་ལྟར་འདི་དག་ནི་ཡོངས་སུ་དག་པའི་ཡེ་ཤེས་ཆེན་པོ་དང་ལྡན་པ་ཡིན་པས་བདག་གིས་འདི་དག་གི་མཆོད་པ་བླང་བའི་མི་རིགས་སོ་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ། །དྲང་སྲོང་དེ་དག་ངས་རྗེས་སུ་བསྟན་པའི་ཕྱིར་དེ་ལྟ་བུའི་ཆོས་ཐོབ་པར་གྱུར་ཀྱང་ངས་ཐོབ་པར་མ་གྱུར་པས་ཆོས་དེ་ཐོབ་པར་བྱས་ཤིང་མངོན་སུམ་དུ་མ་བྱས་པ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ནན་ཏན་བརྩོན་འགྲུས་བསྐྱེད་པར་གྱུར་ཏོ།
en: “At that time, I thought, ‘Since they possess pure and great wisdom, it is not suitable for me to accept their offerings.’ In fact, those sages had obtained such qualities by following my teachings, whereas I had not! Therefore, in order to realize the Dharma that I had received but not yet realized, I developed persistent diligence.

source: །གླང་པོ་ཆེའི་ལག་ངས་ནན་ཏན་བརྩོན་འགྲུས་བསྐྱེད་ནས་ཆོས་དེ་མངོན་དུ་བྱས་པའི་ཚེ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་ཞིག་འོངས་ཏེ་མངོན་དུ་ལུས་བསྟན་ནས་ང་ལ་འདི་སྐད་དུ་ཀྱེ་ཡེ་ཤེས་འདི་ལ་མངོན་པར་ཞེན་པར་མ་བྱེད་ཅིག །ཁྱོད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་ཚད་མེད་དཔག་ཏུ་མེད་པ་རྣམས་ཡོངས་སུ་ཟློ་བར་འགྱུར་རོ་ཞེས་བསྒོའོ།
en: “Elephant Trunk, after I gave rise to persistent diligence, I also realized that Dharma. At that time a god from the pure realms arrived in front of me and prophesied, ‘Do not cling to this wisdom! After you fully awaken to unsurpassed and perfect buddhahood, you will liberate innumerable sentient beings.’

source: །གླང་པོ་ཆེའི་ལག་ངས་དེའི་ཚེ་དེ་སྐད་བསྒོ་བ་ཐོས་ནས་ལམ་བསྒོམ་པ་བཏང་བས་སེམས་མཆོག་ཏུ་དགའ་བ་ཐོབ་པར་གྱུར་ནས་ཟླ་བ་ཕྱེད་ཀྱི་བར་དུ་དབེན་པར་འདུག་པའི་ཚེ་དགའ་བས་ལུས་ཀུན་དུ་ཁྱབ་པར་གྱུར་ཏོ།
en: Elephant Trunk, after hearing those words, I obtained supreme mental joy by cultivating the path. Then, as I sat in solitude for half a month, my entire body became filled with bliss.

source: །གླང་པོ་ཆེའི་ལག་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་པར་གྱུར་ན་ལྷ་རྣམས་ཀྱིས་གོ་བར་བྱེད་ཅིང་རབ་ཏུ་དགའ་བའི་སེམས་ཀྱང་འཐོབ་པར་འགྱུར་ལ། བདག་ཉིད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་རིག་པར་བྱའོ།
en: “Elephant Trunk, if bodhisattvas possess these four qualities, you should know that the gods will instruct them, their minds will become utterly joyful, and they will know that they themselves will attain unsurpassed and perfect awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་ཉིད་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་སེམས་རབ་ཏུ་བསྐྱེད་ནས་གཞན་དག་ཀྱང་སེམས་བསྐྱེད་པར་སྐུལ་བ་ཡིན།
en: (1) Once bodhisattvas themselves have given rise to the mind set on awakening, they encourage others also to give rise to that attitude.

source: ཐེག་པ་ཆེན་པོར་སེམས་བསྐྱེད་པ་དག་མཐོང་ན་ཕྲག་དོག་ཀྱང་མི་བྱེད་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་བདག་གཅིག་པུས་ཐོབ་པར་བྱ་བ་ཡིན་གྱི །གཞན་གྱིས་ཐོབ་པར་བྱ་བ་མ་ཡིན་ནོ་སྙམ་དུ་མི་སེམས་པ་ཡིན།
en: (2) When they see followers of the Great Vehicle who have given rise to the mind set on awakening, they do not become jealous—they do not think that only they should obtain unsurpassed and perfect awakening, while others should not.

source: སེམས་ཅན་ཉེས་པར་སྤྱོད་པ་དག་ལ་དུས་དུས་སུ་རྗེས་སུ་འདོམས་ཤིང་སེམས་བཟང་པོས་གཏམ་དག་སྨྲས་ནས་དེ་དག་གི་དགེ་བ་ཡོངས་སུ་སྲུང་བར་བྱེད་པ་ཡིན།
en: (3) At appropriate times they instruct sentient beings who adopt negative forms of behavior. Conversing with them with a good heart, they protect their virtues.

source: བདག་ཉིད་རྟག་པར་རབ་ཏུ་བརྩོན་པའི་སེམས་ཀྱིས་ཆོས་རྣམས་རྒྱ་ཆེར་གཉེར་ཞིང་གཞན་དག་ལ་བསྟན་ནས་སེར་སྣ་མེད་པར་གྱུར་པ་ཡིན་ཏེ།
en: (4) With great efforts, they themselves constantly pursue the Dharma on a vast scale, and they teach it to others free from miserliness.

source: གླང་པོ་ཆེའི་ལག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་པར་གྱུར་ན་ལྷ་རྣམས་ཀྱིས་ཀྱང་གོ་བར་བྱེད་ལ། བདག་ཉིད་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བར་རིག་པར་བྱའོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་རབ་ཏུ་གསལ་བར་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Elephant Trunk, if bodhisattva great beings possess these four qualities, you should know that the gods will instruct them, and they will know that they themselves will attain unsurpassed and perfect awakening.” At that moment, the Blessed One uttered these verses to explain those points clearly:

source: བྱང་ཆུབ་སེམས་དཔའ་བརྟན་སེམས་ཀྱིས། །བླ་མེད་ཐེག་ལ་རབ་གནས་ཤིང་།
en: “Bodhisattvas follow the unsurpassed vehicle With a stable mind.

source: །སེམས་ཅན་དག་ཀྱང་བསྐུལ་བྱས་ནས།
en: Encouraging sentient beings,

source: །ཐེག་པ་དེ་ལ་འགོད་པར་བྱེད།
en: They also establish them in that vehicle.

source: །བྱང་ཆུབ་སེམས་དཔའ་སྤྱད་སྤྱོད་ཚེ།
en: “When they practice bodhisattva conduct,

source: །རྟག་པར་ཕྲག་དོག་ཁོང་ཁྲོ་མེད།
en: They are always free from jealousy and aggression.

source: །ནན་ཏན་བརྩོན་འགྲུས་རྩོམ་བྱེད་པས།
en: Since they cultivate persistent diligence,

source: །དགའ་བའི་སེམས་ནི་འཕེལ་བར་འགྱུར།
en: Joy will increase in their minds.

source: །སེམས་ཅན་སྡིག་སྤྱོད་མཐོང་གྱུར་ན།
en: “When they see others performing evil deeds,

source: །དུས་སུ་རྗེས་སུ་འདོམས་པར་བྱེད།
en: They instruct them at the appropriate time.

source: །རྟག་པར་བྱམས་དང་སྙིང་རྗེར་ལྡན།
en: Always loving and compassionate,

source: །ཁོང་ཁྲོ་དག་ནི་མེད་པ་ཡིན།
en: They are free from any form of aggression.

source: །རྟག་པར་ནན་ཏན་ཆོས་གཉེར་ནས།
en: “Always pursuing the Dharma persistently,

source: །སེམས་ཅན་རྣམས་ལ་སྤེལ་བར་བྱེད།
en: They propagate it among sentient beings.

source: །ཇི་ལྟར་ཆར་ནི་རླན་བྱེད་ལྟར།
en: Just as rain moistens everything,

source: །ཆོས་ཀྱིས་ཐམས་ཅད་ཚིམ་པར་བྱེད།
en: With the Dharma they satiate everyone.

source: །ཆོས་བཞི་འདི་དག་གང་སྤྱོད་པ། །ཁྱོད་ནི་སངས་རྒྱས་འགྲུབ་འགྱུར་བས། །ཐེ་ཚོམ་སེམས་ནི་མ་སྐྱེད་ཅེས། །ལྷ་རྣམས་ཀྱིས་ནི་གོ་བར་བྱེད།
en: “The gods will instruct them with these words: ‘You who develop these four qualities Will accomplish buddhahood; Do not entertain any doubts about this!’

source: །བྱང་ཆུབ་སེམས་དཔས་དེ་ཐོས་ནས།
en: “After hearing those words, bodhisattvas

source: །ནན་ཏན་བརྩོན་འགྲུས་སྐྱེད་པར་བྱེད།
en: Cultivate persistent diligence.

source: །དངོས་པོ་འདི་ནི་ངེས་བདེན་པས།
en: Thinking, ‘This is certainly true;

source: །བདག་ནི་སངས་རྒྱས་ངེས་འགྲུབ་སེམས།
en: I will definitely accomplish buddhahood,’

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི། །བརྩོན་འགྲུས་དང་ནི་སྨོན་ལམ་དང་། །དྲན་པ་དང་ནི་ཤེས་རབ་དག །བདག་ཉིད་རྒྱ་ཆེར་འཕེལ་བར་འགྱུར།
en: “These bodhisattvas Will then train themselves extensively In diligence, aspiration prayers, Mindfulness, and insight.

source: །གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་རྣམས། །འཇིག་རྟེན་དུ་ནི་བྱུང་གྱུར་ན། །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི། །འདི་འདྲའི་ཡོན་ཏན་ལྡན་པར་འགྱུར།
en: “Even if the thus-gone ones Were to appear in the world, These bodhisattvas Will possess such qualities

source: །གང་ཟག་ཆེན་པོས་བཀུར་འགྱུར་ཞིང་། །རྒྱལ་པོ་བློན་པོ་དམངས་རྣམས་ཀྱང་། །ཐམས་ཅད་སེམས་ནི་རབ་དགའ་ཞིང་། །ལམ་ལྡན་ཡིན་པར་རིག་པར་འགྱུར།
en: “That they will be venerated by great beings, And everyone—kings, ministers, and common people— Will rejoice, and know That they have attained the proper path.

source: །བསྟན་བཅོས་གཙུག་ལག་ཚིག་དང་དོན། །ཚིག་འབྲུ་ཚིགས་བཅད་རྩིས་དང་གྲངས། །དེ་དག་ཐམས་ཅད་ལེགས་རྟོགས་པས། །སེམས་ཅན་ཀུན་གྱི་མཆོག་ཏུ་འགྱུར།
en: “They will genuinely understand The treatises and sacred texts—both in word and meaning—As well as writing, poetry, numbers, and mathematics, Thus becoming supreme among all beings.

source: །དབང་པོ་རྣོ་ཞིང་ཤེས་རབ་ལྡན།
en: “Endowed with sharp faculties and insight,

source: །བྱ་བ་སྟོབས་ལ་མི་ལྟོས་པར།
en: They will act without using force.

source: །ཐབས་དང་ལྡན་པ་འབའ་ཞིག་གིས།
en: Through their skillful means alone,

source: །ཐམས་ཅད་ཡོངས་སུ་གྲུབ་པར་ནུས།
en: They will be able to accomplish everything.

source: །དགྲ་རྣམས་རབ་ཏུ་གདུལ་བ་ཡང་། །ལུས་ཀྱི་ཞོ་ཤ་མི་ལྟོས་པར། །ཤེས་རབ་སྟོབས་ནི་འབའ་ཞིག་གིས། །རང་གི་སེམས་ནི་འདུལ་བར་བྱེད།
en: “Without using physical force, They will subdue their enemies And tame their own minds, Through the power of their insight alone.

source: །སེམས་ཅན་རབ་ཏུ་བརྩེ་བའི་ཕྱིར། །འཇིག་རྟེན་དུ་ནི་སྐྱེས་པས་ན། །རྒྱལ་པོ་བློན་པོ་དམངས་རྣམས་ཀྱང་། །ངོ་མཚར་ཆེ་ཞེས་བསྔགས་པར་འགྱུར།
en: “Because they are born into this world Out of great love for sentient beings, Kings, ministers, and common people Will praise them, filled with a sense of wonder.

source: །ལྷ་རྣམས་ཀུན་ཀྱང་སྨྲ་བས་ན། །དེ་ཡི་ཡ་མཚན་ཀུན་གྱིས་རིག །ཅི་ཕྱིར་དེ་ལྟར་རིག་ཅེ་ན།
en: “As the gods proclaim their praises, Everyone will know about their amazing qualities. Why will they see them in that way?

source: །བདག་སེམས་ཤེས་ཞེས་སེམས་ཕྱིར་རོ།
en: Because they will think, ‘They know our own minds!’

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་རྟག་ཏུ། །སངས་རྒྱས་རྣམས་ནི་མཐོང་བས་ན། །དེར་སོང་ཆོས་ནི་རབ་ཞུས་ནས། །སེམས་ཅན་རྒྱ་ཆེར་ཕན་ཡང་འདོགས།
en: “Since these bodhisattvas Will always encounter buddhas, They will approach them, request the Dharma, And benefit sentient beings on a vast scale.

source: །སངས་རྒྱས་ཞུས་ལན་གསུངས་པས་ན། །ཐེ་ཚོམ་དག་ནི་ཆད་པར་འགྱུར།
en: “Because the buddhas will answer their questions, All their doubts will be eliminated.

source: །སེམས་ཅན་རྣམས་ནི་ཕན་འདོགས་པས། །ཐམས་ཅད་དགའ་བ་ཐོབ་པར་འགྱུར།
en: Since they benefit sentient beings, Everyone will become joyful.

source: །སངས་རྒྱས་རྫུ་འཕྲུལ་མཐུ་བསྟན་ནས། །སངས་རྒྱས་འགྱུར་བར་ལུང་སྟོན་པས།
en: “After displaying their miraculous powers, The buddhas foretell their awakening.

source: །དེ་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དེ། །སེམས་ནི་དགའ་བ་ཐོབ་པར་འགྱུར།
en: Therefore, these bodhisattvas Will become joyful.

source: །ཤིན་ཏུ་ཕངས་པའི་ནོར་རྣམས་དང་། །ཕྱི་ནང་ཀུན་ལ་ཆགས་མེད་པས། །དེ་ཕྱིར་དགའ་བ་ཆེན་པོ་ཡིས། །བདག་ཉིད་སངས་རྒྱས་འགྲུབ་པར་ཤེས།
en: “Since they are free from attachment to wealth And everything inner and outer, They understand with great joy that They will reach the level of buddhahood.

source: །སངས་རྒྱས་རྣམས་ཀྱིས་བསྔགས་པ་ཡི། །བཟོད་པ་གྱ་ནོམ་ཐོབ་པས་ན། །དེ་ཕྱིར་དགའ་བ་ཆེན་པོ་ཡིས། །བདག་ཉིད་སངས་རྒྱས་འགྲུབ་པར་ཤེས།
en: “Because they have developed the excellent acceptance That is praised by the buddhas, They understand with great joy that They will reach the level of buddhahood.

source: །ཆོས་རྣམས་ཀུན་ལ་མི་གནས་ཤིང་། །ཆོས་བརྟན་མི་རུང་རིག་པས་ན། །དེ་འདྲའི་ཤེས་རབ་ཐོབ་གྱུར་ནས། །ལུས་ནི་མཁའ་ལ་འཕགས་པར་འགྱུར།
en: “Since they do not dwell on any phenomenon And know that phenomena cannot be relied upon, Their bodies will rise up in the sky Upon obtaining such insight.

source: །དེ་ཡི་སེམས་ནི་ནང་མི་གནས། །ཕྱི་རོལ་ན་ཡང་མི་གནས་ཏེ།
en: “Their minds do not dwell on Any inner or outer phenomenon.

source: །འདུ་ཤེས་ཐམས་ཅད་འདས་པས་ན།
en: Transcending all concepts,

source: །དེ་ཕྱིར་བཟོད་པ་བླ་མེད་ཐོབ།
en: They obtain unsurpassed acceptance.

source: །ཡུན་རིང་བྱམས་དང་སྙིང་རྗེ་ཡིས། །སེམས་ཅན་ཀུན་ལ་སེམས་པས་ན། །དེ་ཕྱིར་བསོད་ནམས་དེ་ཡི་དབང་། །སངས་རྒྱས་ཚད་མེད་མཐོང་བར་འགྱུར།
en: “Because they have considered all sentient beings With love and compassion for a long time, They will meet innumerable buddhas Through the power of that merit.

source: །དེ་ཡི་ལུས་ནི་ཐམས་ཅད་ཀུན། །སངས་རྒྱས་སྐུ་དང་ཁྱད་པར་མེད།
en: “Their bodies are in no way different from The bodies of the buddhas.

source: །དེ་འདྲའི་བཟོད་པ་ཐོབ་པས་ནི། །ཆོས་ཀྱི་བདག་ཉིད་འཕེལ་བར་བྱེད།
en: Because they have developed such acceptance, They train themselves by means of the Dharma.

source: །བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་ལ། །སུ་ཞིག་རྗེས་སུ་སློབ་མི་བྱེད།
en: “Who would not follow their example And give rise to the mind set on awakening?

source: །རབ་བརྟན་དམ་ཆོས་གང་གནས་པ།
en: Those who follow the sacred Dharma consistently

source: །འདི་འདྲའི་ཡོན་ཏན་ཐོབ་པར་འགྱུར།
en: Will obtain such qualities.

source: །དེ་ཕྱིར་ལམ་ནི་གཉེར་བ་དག །རྟག་པར་ནན་ཏན་ཆོས་གཉེར་བྱ།
en: “Therefore, those who pursue the path Must always persistently seek the Dharma!

source: །ཆོས་ཀྱིས་བདག་གི་ཁེ་བཙལ་ནས། །བྱང་ཆུབ་ལ་ནི་ཕན་གདགས་བྱ།
en: Having sought their personal benefit through the Dharma, They should use it to advance toward awakening.”

source: །བརྒལ་བའི་ལན་གདབ་པའི་ལེའུ་སྟེ་བདུན་པའོ།། །།
en: This was the seventh chapter, Responding to Controversies.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱིས་འདས་པའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་དགེ་བའི་ཆོས་རྣམ་པ་སྣ་ཚོགས་ལ་ཤིན་ཏུ་བརྟན་པར་གནས་པར་གྱུར་པ་ནི་ངོ་མཚར་ཆེ་ལགས་སོ།
en: Then venerable Pūrṇa Maitrāyaṇīputra said to the Blessed One, “Blessed One, it is a great wonder that in the past, when the Blessed One was practicing bodhisattva conduct, he observed those various types of virtuous qualities so resolutely!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། །གང་པོ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: “Thus it is, Pūrṇa, thus it is,” answered the Blessed One.

source: ང་ནི་ཡུན་རིང་པོ་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་དགེ་བའི་ཆོས་ལ་ཤིན་ཏུ་བརྟན་པར་གནས་པར་གྱུར་ཏོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་རབ་ཏུ་གསལ་བར་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: “For a long time, while I practiced bodhisattva conduct, I observed those virtuous principles very resolutely.” At that point, the Blessed One uttered these verses to explain this clearly:

source: ཆོས་གཉེར་ཆོས་ནི་གང་ཐོབ་པ།
en: “To pursue the Dharma and obtain it

source: །དེ་ནི་སངས་རྒྱས་ལམ་གཞི་ཡིན།
en: Is the basis of the path of the buddhas.

source: །རྟག་ཏུ་ཆོས་ལ་གང་བརྩོན་པ།
en: Those who always put effort into following the Dharma

source: །ཆོས་མ་ཡིན་པ་སྤོང་བར་འགྱུར།
en: Will abandon everything that is not the Dharma.

source: །རྟག་ཏུ་ཡང་དག་ལམ་སྤྱོད་པ།
en: “Always practicing the authentic path,

source: །ལོག་པའི་ལམ་ནི་སྤོང་བར་བྱེད།
en: They will abandon mistaken paths.

source: །སངས་རྒྱས་ཆོས་ལ་རྟག་བསྟེན་པ།
en: Always relying on the Dharma of the Buddha,

source: །དེ་ནི་ལམ་ལ་བསྟེན་པར་འགྱུར།
en: They will follow his path.

source: །དེས་ན་མི་ཁོམ་རྣམས་སྤངས་ནས།
en: “Therefore, after abandoning the unfree states,

source: །ཁོམ་ལྡན་དག་ནི་ཐོབ་པར་འགྱུར།
en: They will obtain the freedoms.

source: །ཁོམ་ལྡན་གནས་ནི་ཐོབ་གྱུར་ན།
en: If these states of freedom are obtained,

source: །བརྩོན་འགྲུས་བརྩམས་པ་ཆུད་མི་ཟ།
en: The diligence they have cultivated will not be wasted.

source: །གནས་གཉིས་སུ་ནི་མཆོག་ཏུ་བཙུན།
en: “They will be supremely noble within the twofold abode.

source: །ཁ་དོག་གཟུགས་ནི་མཆོག་ཏུ་འགྱུར།
en: They will have the foremost physical appearance,

source: །གཡོག་འཁོར་དག་ནི་ཕུན་ཚོགས་ཤིང་།
en: They will be surrounded by perfect servants and retinues,

source: །ཐམས་ཅད་ཀུན་གྱི་མཆོག་ཏུ་འགྱུར།
en: And they will become the most supreme of all beings.

source: །བརྟན་པའི་སེམས་ཀྱིས་རྟག་ཏུ་ནི། །ཚུལ་ཁྲིམས་བཟོད་པའི་ཕྱོགས་ལ་གནས།
en: “They always observe discipline And practice patience with a stable mind.

source: །བརྩོན་འགྲུས་ཕྱོགས་ལ་རབ་གནས་ཤིང་། །བསམ་གཏན་ཤེས་རབ་འཕེལ་བར་བྱེད།
en: Always observing diligence, They will cultivate their concentration and insight.

source: །རྟག་ཏུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །གཙོ་མཆོག་དག་ནི་བྱེད་པར་འགྱུར།
en: “They will always act as the leaders Of all sentient beings.

source: །ཡོན་ཏན་ཀུན་གྱི་མཆོག་གྱུར་པས། །དོན་རིག་འཇིགས་པ་ཅི་ཡང་མེད།
en: Endowed with the most sublime qualities, They know the truth and are free from fear.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་གང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་བུའི་ཆོས་གྱ་ནོམ་པ་དག་ལ་སུ་ཞིག་སློབ་པར་མི་བགྱིད་དེ།
en: Then Pūrṇa said to the Blessed One, “Blessed One, who would not train in such an excellent Dharma?

source: བདག་ཅག་ནི་སྔོན་དང་དང་པོ་ནས་ལེ་ལོ་ཅན་དུ་གྱུར་པས་སངས་རྒྱས་ཀྱི་མཁྱེན་པ་ལ་རེ་བ་མ་མཆིས་ཤིང་བདག་ཅག་སངས་རྒྱས་ཀྱི་མཁྱེན་པ་འདི་ལྟ་བུ་ཐོབ་པར་འགྱུར་བར་མངོན་པར་ཡིད་ཆེས་པ་མ་མཆིས་པ་ན།
en: In the past, we were lazy and had no hope of developing the insight of the buddhas, nor did we believe that we could ever attain such insight.

source: འདི་ལྟར་ཉན་ཐོས་ཀྱི་ཐེག་པས་བདག་ཉིད་ངེས་པར་བྱུང་བར་གྱུར་པ་ལགས་སོ་སྙམ་སེམས་སོ།
en: Therefore, we thought that we would be emancipated through the vehicle of the hearers.

source: །བཅོམ་ལྡན་འདས་བདག་ནི་དེང་སླན་ཆད་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གཟེངས་སྟོད་ཅིང་། སྤྲོ་བ་བསྐྱེད་ནས་སངས་རྒྱས་ཀྱི་ཆོས་ལ་དགོད་པར་བགྱིད་ལགས་སོ།
en: “Blessed One, from now on, I will encourage and take delight in bodhisattvas, and thereby help in their efforts to establish beings in the Dharma of the Buddha.

source: །དེའི་སླད་དུ་ཞེ་ན།
en: Why is that?

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཤིན་ཏུ་དཀའ་བ་མཛད་པ་ལགས་པས་བཅོམ་ལྡན་འདས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་སེམས་ཅན་གྱི་ཆེད་དུ་རྟག་པར་དེ་ལྟ་བུའི་ཤིན་ཏུ་དཀའ་བའི་དངོས་པོ་ཤ་སྟག་མཛད་དེ།
en: Because the Buddha, the Blessed One, has undergone great hardships. When he practiced bodhisattva conduct in the past, he always engaged in such great hardships for the sake of sentient beings.

source: དེ་ལྟ་བུའི་དངོས་པོ་དེ་ནི་དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལ་ཡང་མ་མཆིས་ན། སེམས་ཅན་གཞན་ལ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་བས་སོ།
en: The worthy ones and the solitary buddhas are not able to undergo such hardships, so there is no need to mention other sentient beings!

source: །བཅོམ་ལྡན་འདས་དེ་ལྟ་བུའི་ཤིན་ཏུ་དཀའ་བའི་དངོས་པོ་ཆེན་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོར་གྱུར་པ་འབའ་ཞིག་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཤིན་ཏུ་དཀའ་བའི་དངོས་པོ་ཆེན་པོ་དེ་ལྟ་བུ་ཚད་མ་མཆིས། དཔག་ཏུ་མ་མཆིས།
en: “Blessed One, it is only the bodhisattva great beings who, when they practice bodhisattva conduct, undergo such immeasurable, boundless, and countless great hardships out of love for all beings.

source: གྲངས་མ་མཆིས་པ་དག་སྤྱད་པས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དེ་ལྟ་བུའི་ཤིན་ཏུ་དཀའ་བའི་དངོས་པོ་ཆེན་པོ་སྤྱད་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: Therefore, Blessed One, after having engaged in such great hardships, those bodhisattvas will awaken to unsurpassed and perfect buddhahood.

source: ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་བསྐོར་ཏེ། སེམས་ཅན་སྡུག་བསྔལ་གྱིས་གཟིར་བ་རྣམས་ཡོངས་སུ་བཟླ་བར་བགྱིད་ལགས་སོ།
en: Then they will turn the Dharma wheel and liberate sentient beings who are tormented by suffering.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: “Thus it is, Pūrṇa, thus it is!” said the Blessed One.

source: ཁྱོད་ཀྱིས་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས།
en: “Just as you have said, bodhisattvas give rise to the mind set on unsurpassed and perfect awakening.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕན་པ་དང་། བདེ་བ་ཡོངས་སུ་གཉེར་བའི་ཕྱིར། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་པས།
en: Then, concerned for the benefit and happiness of all sentient beings, they develop great love and compassion toward everyone.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆེད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། དེ་ལྟ་བུའི་སྨོན་ལམ་ཆེན་པོ་དང་། དཀའ་བའི་དངོས་པོ་ཆེན་པོ་ཤིན་ཏུ་ཟབ་པ། ཤིན་ཏུ་དཀའ་བ། ཚད་མེད། དཔག་ཏུ་མེད། གྲངས་མེད་པ་དང་ལྡན་པར་གྱུར་བ་ཡིན་ནོ། །
en: Therefore, when they practice bodhisattva conduct for the sake of all beings, bodhisattvas have such great aspirations and undergo such very intense, difficult, immeasurable, boundless, and countless great hardships.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་གང་པོ་དང་། འཁོར་བཞི་པོ་རྣམས་དང་། ལྷ་དང་། མི་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པ་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་རབ་ཏུ་དགའ་ཞིང་ཡིད་ཆེས་པས་མངོན་པར་བསྟོད་དོ།། །།
en: When the Blessed One had said those words, venerable Pūrṇa and the four retinues, together with all gods, humans, nāgas, yakṣas, gandharvas, and demigods, praised the words of the Blessed One with great exhilaration and trust.

source: ཚེ་དང་ལྡན་པ་གང་པོའི་ལེའུ་སྟེ་བརྒྱད་པའོ།། །།
en: This was the eighth chapter, Venerable Pūrṇa.

source: འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་གང་པོས་ཞུས་པའི་ལེའུ་སྟེ་བཅུ་བདུན་པ་རྫོགས་སོ།། །།
en: This concludes The Questions of Pūrṇa, the seventeenth of the one hundred thousand sections of the Dharma discourse known as The Noble Great Heap of Jewels.
